/*-------------------------------------------------*/
/*            超纬电子STM32系列开发板              */
/*-------------------------------------------------*/
/*                                                 */
/*            实现定时器1功能的头文件              */
/*                                                 */
/*-------------------------------------------------*/

#include "stm32f10x.h"  //包含需要的头文件

#ifndef _TIMER1_H
#define _TIMER1_H



void TIM1_ENABLE_60S(void);
void Timer1_Init(u16 arr,u16 psc);

#endif
